<?php
//!---- (PHP): Массивы: Сравнения:

$a = [1,2,3];
$b = [1,2,4,5,6];
$c = ["a"=>1, "b"=>2];
$d = ["a"=>1, "d"=>2];

$r =
[
    $a == $b,                   // массивы можно сравнить напрямую

    array_intersect($a, $b),    // [0=>1, 1=>2]

    array_diff($c,$d),          // []
    array_diff_assoc($c,$d),    // [b]=>2

    array_udiff(                // найдет что в $a отличается от $b
        $a, $b,
        function($a, $b) {return $a <=> $b;}
    ),                          // [2]=>3
];
print_r($r);

?>

